vizualjack/bl602_rgb_controller/customer_app/custom_app/custom_app/main.c
   if(lenstr%2) {
       lenstr -= (lenstr%2);
   }

   if(lenstr==0){
       return;
   }

   for(i=0; i < lenstr; i+=2) {
       h4=char_to_hex(bssid[i]);
       l4=char_to_hex(bssid[i+1]);
       hex[i/2]=(h4<<4)+l4;
   }
}

int check_dts_config(char ssid[33], char password[64])
{
    bl_wifi_ap_info_t sta_info;

    if (bl_wifi_sta_info_get(&sta_info)) {
        /*no valid sta info is got*/
        return -1;
    }

    strncpy(ssid, (const char*)sta_info.ssid, 32);
    ssid[31] = '\0';
    strncpy(password, (const char*)sta_info.psk, 64);
    password[63] = '\0';

    return 0;
}


static void connect_wifi(char *ssid, char *password)
{
    wifi_interface_t wifi_interface;

    wifi_interface = wifi_mgmr_sta_enable();
    wifi_mgmr_sta_connect(wifi_interface, ssid, password, NULL, NULL, 0, 0);
}

static int http_rest_post_wifi(char* buf) {
    // SSID
    char* ssid_start = strstr(buf, "name=\"ssid\"\r\n\r\n");
    ssid_start += 15;
    if(ssid_start == NULL) {
        puts("Can't find SSID");
        return ERR_ARG;
    }
    char* ssid_end = strstr(ssid_start, "\r\n------");
    if(ssid_end == NULL) {
        puts("Can't find SSID end");
        printf("Start: %s\r\n", ssid_start);
        return ERR_ARG;
    }
    int ssid_len = ssid_end - ssid_start;
    printf("SSID length: %d\r\n", ssid_len);
    char ssid[ssid_len + 1];
    memcpy(ssid, ssid_start, ssid_len);
    ssid[ssid_len] = '\0';
    printf("Wifi SSID: %s\r\n", ssid);
    // PASSWORD
    char* pass_start = strstr(ssid_end, "name=\"pass\"\r\n\r\n");
    if(pass_start == NULL) {
        puts("Can't find PASS\r\n");
        return ERR_ARG;
    }
    pass_start += 15;
    char* pass_end = strstr(pass_start, "\r\n------");
    if(pass_end == NULL) {
        puts("Can't find PASS end\r\n");
        return ERR_ARG;
    }
    int pass_len = pass_end - pass_start;
    printf("PASS length: %d\r\n", pass_len);
    char pass[pass_len + 1];
    memcpy(pass, pass_start, pass_len);
    pass[pass_len] = '\0';
    printf("Wifi PASS: %s\r\n", pass);
    ef_set_env_blob(WIFI_SSID_KEY, (const char *)&ssid, ssid_len + 1);
    ef_set_env_blob(WIFI_PASS_KEY, (const char *)&pass, pass_len + 1);
    return ERR_OK;
}


/////// CUSTOM CODE HERE
#define OTA_PROGRAM_SIZE (512)
static int http_rest_post_flash(struct netconn *conn, int content_length)
{
	int total = 0;
	int towrite = content_length;
	// char* writebuf = max_file_size;
	int writelen = content_length;
	int fsize = 0;

	// ADDLOG_DEBUG(LOG_FEATURE_OTA, "OTA post len %d", request->contentLength);

	int sockfd, i;
	int ret;
	struct hostent* hostinfo;
	uint8_t* recv_buffer;
	struct sockaddr_in dest;
	// iot_sha256_context ctx;
	uint8_t sha256_result[32];
	uint8_t sha256_img[32];
	bl_mtd_handle_t handle;

	ret = bl_mtd_open(BL_MTD_PARTITION_NAME_FW_DEFAULT, &handle, BL_MTD_OPEN_FLAG_BACKUP);
	if(ret)
	{
		// return http_rest_error(request, -20, "Open Default FW partition failed");
        puts("Open Default FW partition failed\r\n");
        return 1;
	}

	recv_buffer = pvPortMalloc(OTA_PROGRAM_SIZE);

	unsigned int buffer_offset, flash_offset, ota_addr;
	uint32_t bin_size;
	uint8_t activeID;
	HALPartition_Entry_Config ptEntry;

	activeID = hal_boot2_get_active_partition();

	// printf("Starting OTA test. OTA bin addr is %p, incoming len %i\r\n", recv_buffer, writelen);

	// printf("[OTA] [TEST] activeID is %u\r\n", activeID);

	if(hal_boot2_get_active_entries(BOOT2_PARTITION_TYPE_FW, &ptEntry))
	{
		vPortFree(recv_buffer);
		bl_mtd_close(handle);
		// return http_rest_error(request, -20, "PtTable_Get_Active_Entries fail");
        puts("PtTable_Get_Active_Entries fail\r\n");
        return 1;
	}
	ota_addr = ptEntry.Address[!ptEntry.activeIndex];
	bin_size = ptEntry.maxLen[!ptEntry.activeIndex];

	// part_size = ptEntry.maxLen[!ptEntry.activeIndex];
	// (void)part_size;
	/*XXX if you use bin_size is product env, you may want to set bin_size to the actual
	 * OTA BIN size, and also you need to splilt XIP_SFlash_Erase_With_Lock into
	 * serveral pieces. Partition size vs bin_size check is also needed
	 */

	// printf("Starting OTA test. OTA size is %lu\r\n", bin_size);

    if(content_length >= bin_size)
    {
        puts("BIN file is too big");
        return 1;
        // return http_rest_error(request, -20, "Too large bin");
    }

	// printf("[OTA] [TEST] activeIndex is %u, use OTA address=%08x\r\n", ptEntry.activeIndex, (unsigned int)ota_addr);

	printf("[OTA] Erasing flash (%lu)...\r\n", bin_size);
	hal_update_mfg_ptable();

	// Erase in chunks, because erasing everything at once is slow and causes issues with http connection
    // ERASING
	uint32_t erase_offset = 0;
	uint32_t erase_len = 0;
	while(erase_offset < bin_size)
	{
		erase_len = bin_size - erase_offset;
		if(erase_len > 0x10000)
		{
			erase_len = 0x10000; //Erase in 64kb chunks
		}
		bl_mtd_erase(handle, erase_offset, erase_len);
		// printf("[OTA] Erased:  %lu / %lu \r\n", erase_offset, erase_len);
		erase_offset += erase_len;
        sys_msleep(100);
	}
	printf("[OTA] Flash erased\r\n");
    // === ERASING ===


    // TODO: Edit write logic code
    // If more data is expected, read it into a buffer
    // grab data from http post request and write it to flash
    
    
    
	printf("[OTA] Flashing new firmware\r\n");
    struct netbuf *inbuf;
    char *buf;
    u16_t buflen;
    int remaining = content_length;
    // char *data_start;
    char *data_end;
    bool first = true;
    flash_offset = 0;
    while (remaining > 0) {
        // char chunk[MAX_BUFFER_SIZE];
        // int to_read = remaining > MAX_BUFFER_SIZE ? MAX_BUFFER_SIZE : remaining;
        err_t recv_err = netconn_recv(conn, &inbuf);
        if (recv_err == ERR_OK) {
            netbuf_data(inbuf, (void **)&buf, &buflen);
            // memcpy(post_data + body_length, buf, buflen);
            // body_length += buflen;
            // printf("Buflen: %d\r\n", buflen);
            remaining -= buflen;
            // data transmission
            if (first) {
                char *before = buf;
                buf = strstr(buf, "\r\n\r\n");
                buf += 4; // Skip past "\r\n\r\n"
                first = false;
                int skipped_bytes = buf - before;
                if(skipped_bytes <= 0) {
                    puts("Something is totally wrong\r\n");
                    netbuf_delete(inbuf);
                    return ERR_ARG;
                }
                buflen -= skipped_bytes;
                printf("[OTA] Found data start, skipping %td bytes\r\n", skipped_bytes);
            }
            data_end = strstr(buf, "\r\n------");
            if(data_end != NULL) {
                buflen = (data_end - buf);
                printf("[OTA] Found data end, last frame total bytes are %td\r\n", data_end - buf);
            }
            bl_mtd_write(handle, flash_offset, buflen, (u_int8_t*)buf);
            flash_offset += buflen;
            total += buflen;
            // printf("Flash takes %i\r\n", buflen);
            // printf("remaining %i\r\n", remaining);
            // printf("total %i\r\n", total);
            netbuf_delete(inbuf);
        } else {
            puts("Error receiving additional data\n");
            // free(post_data);
            netbuf_delete(inbuf);
            return ERR_CLSD;
        }
    }
	printf("[OTA] Flashed new firmware\r\n");
    // flash write logic
	// buffer_offset = 0;
	// flash_offset = 0;
	// do
	// {
	// 	char* useBuf = writebuf;
	// 	int useLen = writelen;


	// 	if(useLen)
	// 	{
			
	// 		//ADDLOG_DEBUG(LOG_FEATURE_OTA, "%d bytes to write", writelen);
	// 		//add_otadata((unsigned char*)writebuf, writelen);

	// 		printf("Flash takes %i. ", useLen);
	// 		bl_mtd_write(handle, flash_offset, useLen, (u_int8_t*)useBuf);
	// 		flash_offset += useLen;
	// 	}

	// 	total += writelen;
	// 	towrite -= writelen;

